# IPrintSetting Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IPrintSetting Members
IPrintSetting Interface Properties See Also
---
The IPrintSetting type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PrintParameters | Returns the Parameters of Print Setup. |

# See Also
IPrintSetting Interface
Autodesk.Revit.DB Namespace